*>*******************************************
*>                                          *
*>  File Definition For The Open Item File  *
*>                                          *
*>*******************************************
      *>  size 109 26/03/09
      *>  size 113 07/01/18 to match invoice record. 
 fd  open-item-file-4.
*>
 01  open-item-record-4  pic x(113).
