*>*******************************************
*>                                          *
*>  File Definition For The Open Item File  *
*>                                          *
*>*******************************************
*> 114 bytes 09/03/09
*> 118 bytes 08/02/17
*>
 fd  open-item-file-2.
*>
 01  open-item-record-2     pic x(118).
*>
