*>*******************************************
*>                                          *
*>  File Definition For The Open Item File  *
*>      Purchase                            *
*>*******************************************
*> 109 bytes 26/03/09
*> 113 bytes to match oi5      
*>
 fd  open-item-file-s.
*>
 01  open-item-record-s     pic x(113).
*>
