*>
     select  Invoice-File    assign        file-26
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    invoice-key.
