*>
     select  open-item-file-s  assign        file-27
                               access        sequential
                               status        fs-reply.
