*>
     select  open-item-file-5  assign        file-29,
                               access        dynamic,
                               organization  indexed,
                               status        fs-reply,
                               record key    oi5-key.
*>
