*>
     select  optional Stock-Audit  assign  file-10
                                   access  sequential
                                   status  fs-reply.
