*>
     select  Analysis-File   assign        file-15
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    pa-code.
