*>
     select  BO-Stk-Itm-File assign               file-31
                             access               dynamic
                             organization         indexed
                             status               FS-Reply
                             record key           BO-Cust-Itm-No
                             alternate record key BO-Stk-Item-No  with duplicates
                             alternate record key BO-Stk-Cust-No  with duplicates.
