*>
     select  batch-file      assign        file-7
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    batch-key.
