     select  delivery-file   assign        file-14
                             access        dynamic
                             organization  indexed
                             record key    deliv-key
                             status        fs-reply.
*>
