*>*****************************************************
*>                                                    *
*>  File Definition For The Deleted Invoice Nos File  *
*>          for Purchase delfolio                     *
*>*****************************************************
*> 19 bytes 04/04/09
     select    Del-Inv-Nos-File  assign        File-17
                                 access        dynamic
                                 organization  indexed
                                 record key    Del-Inv-Nos
                                 status        fs-reply.
*>
