*>
     select  open-item-file-4  assign        file-28
                               access        sequential
                               status        fs-reply.
