*>
     select  open-item-file-2  assign        file-18
                               access        sequential
                               status        fs-reply.
