     select optional irs-post-file  assign file-8
*>                                    organization sequential
                             access        dynamic
                             organization  indexed
                             record key    irs-post-key
                             status        fs-reply.
