*>
     select  Purchase-File   assign        file-22,
                             access        dynamic,
                             organization  indexed,
                             status        fs-reply,
                             record key    purch-key.
