*>
     select  Pay-File        assign        File-32
                             access        dynamic
                             organization  indexed
                             status        FS-Reply
                             record key    Pay-Key.
*>
