*>
     select  posting-file    assign        file-6
                             access        dynamic
 *>                            organization  is relative
 *>                            relative key  is rrn
                             organization indexed
                             record key Post-Rrn    *> MAY NEED CHANGING <<<
                             status        fs-reply.
