     select  system-file     assign        file-0
                             access        dynamic
                             organization  is relative
                             relative key  is rrn
                             status        fs-reply.
*>
