     select  Sales-File      assign        file-12
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    sales-key.
*>
