*>
     select  value-file      assign        file-13
                             access        dynamic
                             organization  indexed
                             status        fs-reply
                             record key    va-code.
