*>
     select  Open-Item-File-3  assign        File-19
                               access        dynamic
                               organization  indexed
                               status        fs-Reply
                               record key    OI3-Key.
*>
