*>
*> Taken from the SL copy in that src dir and prefixed by 'slSEL'.
*>
     select  Agen-Invoice-File    assign        File-4
                                  access        dynamic
                                  organization  indexed
                                  status        FS-Reply
                                  record key    Agen-Invoice-Key.
*>
