*>
*> Taken from the SL copy in that src dir and prefixed by 'sl'.
*>
     select  Invoice-File    assign        File-16
                             access        dynamic
                             organization  indexed
                             status        FS-Reply
                             record key    Invoice-Key.
*>
