*>**************************************************
*>                                                 *
*>   Working Storage For The Final Account Record  *
*>                                                 *
*>**************************************************
*> 416 bytes 02/03/09 but written as 1024 (system-record size) 07/11/10
*>    Can we link this one for GL up with IRS??
*>
 01  Final-Record.
     03  ar1             pic x(16)      occurs  26.
