*>*********
*> maps01 *
*>*********
*>  No longer used as now Open source.
*>
 01  maps01-ws.
     03  encode          pic x.
       88  pass                        value "P".
       88  user-name                   value "N".
     03  pass-word       pic x(4).
     03  pass-name       pic x(32).
