*>*********
*> maps09 *
*>*********
*>
 01  maps09-ws.
     03  customer-code.
         05  customer-nos   pic x(6).
         05  check-digit    pic 9.
     03  maps09-reply       pic x.
